# Introduction to Pandas

## pandas.Series

In [1]:
import pandas as pd
pd.set_option('display.max_columns', 7)

In [2]:
ser1 = pd.Series(range(1, 6))
ser1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
ser2 = pd.Series(range(1, 6), index=['a', 'b', 'c', 'd', 'e'])
ser2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
ser3 = pd.Series({ 'a': 1.0, 'b': 2.0, 'c': 3.0, 'd': 4.0, 'e': 5.0 })
ser3

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
dtype: float64

In [5]:
ser3.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [6]:
ser3.values

array([1., 2., 3., 4., 5.])

In [7]:
ser3.name = 'Alphanumeric'
ser3

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: Alphanumeric, dtype: float64

## pandas.DataFrame

In [8]:
df1 = pd.DataFrame({'A': range(1,5,1), 'B': range(10,50,10), 'C': range(100, 500, 100)})
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400

In [9]:
df2 = pd.DataFrame({'A': range(1,5,1), 'B': range(10,50,10), 'C': range(100, 500, 100)}, index=['a', 'b', 'c', 'd'])
df2

   A   B    C
a  1  10  100
b  2  20  200
c  3  30  300
d  4  40  400

In [10]:
df2.columns

Index(['A', 'B', 'C'], dtype='object')

In [11]:
df2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [12]:
df2.values

array([[  1,  10, 100],
       [  2,  20, 200],
       [  3,  30, 300],
       [  4,  40, 400]], dtype=int64)

In [13]:
df2['D'] = range(1000,5000,1000)
df2

   A   B    C     D
a  1  10  100  1000
b  2  20  200  2000
c  3  30  300  3000
d  4  40  400  4000

In [14]:
df2.index.name = 'lowercase'
df2

           A   B    C     D
lowercase
a          1  10  100  1000
b          2  20  200  2000
c          3  30  300  3000
d          4  40  400  4000

In [15]:
df2.columns.name = 'uppercase'
df2

uppercase  A   B    C     D
lowercase
a          1  10  100  1000
b          2  20  200  2000
c          3  30  300  3000
d          4  40  400  4000

## pandas.Index

In [16]:
ind1 = pd.Index(range(5))
ind1

RangeIndex(start=0, stop=5, step=1)

In [17]:
ind2 = pd.Index(list(range(5)))
ind2

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [18]:
#ind2[0] = -1

# Essential pandas.DataFrame operations

## Indexing, Selection and Filtering of DataFrames

In [19]:
df2

uppercase  A   B    C     D
lowercase
a          1  10  100  1000
b          2  20  200  2000
c          3  30  300  3000
d          4  40  400  4000

In [20]:
df2['B']

lowercase
a    10
b    20
c    30
d    40
Name: B, dtype: int64

In [21]:
df2[['A', 'C']]

uppercase  A    C
lowercase
a          1  100
b          2  200
c          3  300
d          4  400

In [22]:
df2[(df2['D'] > 1000) & (df2['D'] <= 3000)]

uppercase  A   B    C     D
lowercase
b          2  20  200  2000
c          3  30  300  3000

In [23]:
df2.loc[['c', 'd']]

uppercase  A   B    C     D
lowercase
c          3  30  300  3000
d          4  40  400  4000

In [24]:
df2.iloc[[0]]

uppercase  A   B    C     D
lowercase
a          1  10  100  1000

In [25]:
df2[df2['D'] == 2000] = 0
df2

uppercase  A   B    C     D
lowercase
a          1  10  100  1000
b          0   0    0     0
c          3  30  300  3000
d          4  40  400  4000

## Dropping rows and columns from a DataFrame

In [26]:
df2

uppercase  A   B    C     D
lowercase
a          1  10  100  1000
b          0   0    0     0
c          3  30  300  3000
d          4  40  400  4000

In [27]:
df2.drop('b')

uppercase  A   B    C     D
lowercase
a          1  10  100  1000
c          3  30  300  3000
d          4  40  400  4000

In [28]:
df2

uppercase  A   B    C     D
lowercase
a          1  10  100  1000
b          0   0    0     0
c          3  30  300  3000
d          4  40  400  4000

In [29]:
df2.drop('b', inplace=True)
df2

uppercase  A   B    C     D
lowercase
a          1  10  100  1000
c          3  30  300  3000
d          4  40  400  4000

In [30]:
df2.drop(['a', 'd'])

uppercase  A   B    C     D
lowercase
c          3  30  300  3000

In [31]:
df2.drop(['A', 'B'], axis=1)

uppercase    C     D
lowercase
a          100  1000
c          300  3000
d          400  4000

## Sorting Values and Ranking the Values Order within a DataFrame

In [32]:
import numpy as np
np.random.seed(0)

In [33]:
df = pd.DataFrame(np.random.randn(5,5), index=np.random.randint(0, 100, size=5), columns=np.random.randint(0, 100, size=5))
df

          17        79        4         42        58
0   1.764052  0.400157  0.978738  2.240893  1.867558
36 -0.977278  0.950088 -0.151357 -0.103219  0.410599
53  0.144044  1.454274  0.761038  0.121675  0.443863
5   0.333674  1.494079 -0.205158  0.313068 -0.854096
38 -2.552990  0.653619  0.864436 -0.742165  2.269755

In [34]:
df.sort_index()

          17        79        4         42        58
0   1.764052  0.400157  0.978738  2.240893  1.867558
5   0.333674  1.494079 -0.205158  0.313068 -0.854096
36 -0.977278  0.950088 -0.151357 -0.103219  0.410599
38 -2.552990  0.653619  0.864436 -0.742165  2.269755
53  0.144044  1.454274  0.761038  0.121675  0.443863

In [35]:
df.sort_index(axis=1)

          4         17        42        58        79
0   0.978738  1.764052  2.240893  1.867558  0.400157
36 -0.151357 -0.977278 -0.103219  0.410599  0.950088
53  0.761038  0.144044  0.121675  0.443863  1.454274
5  -0.205158  0.333674  0.313068 -0.854096  1.494079
38  0.864436 -2.552990 -0.742165  2.269755  0.653619

In [36]:
df.sort_values(by=df.columns[0])

          17        79        4         42        58
38 -2.552990  0.653619  0.864436 -0.742165  2.269755
36 -0.977278  0.950088 -0.151357 -0.103219  0.410599
53  0.144044  1.454274  0.761038  0.121675  0.443863
5   0.333674  1.494079 -0.205158  0.313068 -0.854096
0   1.764052  0.400157  0.978738  2.240893  1.867558

In [37]:
df.rank()

     17   79   4    42   58
0   5.0  1.0  5.0  5.0  4.0
36  2.0  3.0  2.0  2.0  2.0
53  3.0  4.0  3.0  3.0  3.0
5   4.0  5.0  1.0  4.0  1.0
38  1.0  2.0  4.0  1.0  5.0

## Arithmetic Operations on DataFrames

In [38]:
df1 = pd.DataFrame(np.random.randn(3,2), index=['A', 'C', 'E'], columns=['colA', 'colB'])
df1

       colA      colB
A -1.454366  0.815270
C  0.229098 -1.026179
E  0.477525  1.292698

In [39]:
df2 = pd.DataFrame(np.random.randn(4,3), index=['A', 'B', 'C', 'D'], columns=['colA', 'colB', 'colC'])
df2

       colA      colB      colC
A -0.731458 -1.605402  0.989476
B  0.110815 -0.380931  0.114959
C  0.345313 -1.734959  1.658351
D  2.299772 -0.471135  1.262715

In [40]:
df1 + df2

       colA      colB  colC
A -2.185824 -0.790132   NaN
B       NaN       NaN   NaN
C  0.574411 -2.761138   NaN
D       NaN       NaN   NaN
E       NaN       NaN   NaN

In [41]:
df1.add(df2, fill_value=0)

       colA      colB      colC
A -2.185824 -0.790132  0.989476
B  0.110815 -0.380931  0.114959
C  0.574411 -2.761138  1.658351
D  2.299772 -0.471135  1.262715
E  0.477525  1.292698       NaN

In [42]:
df1

       colA      colB
A -1.454366  0.815270
C  0.229098 -1.026179
E  0.477525  1.292698

In [43]:
df2

       colA      colB      colC
A -0.731458 -1.605402  0.989476
B  0.110815 -0.380931  0.114959
C  0.345313 -1.734959  1.658351
D  2.299772 -0.471135  1.262715

In [44]:
df1 - df2[['colB']]

   colA      colB
A   NaN  2.420672
B   NaN       NaN
C   NaN  0.708780
D   NaN       NaN
E   NaN       NaN

## Merging and Combining Multiple DataFrames into a single DataFrame

In [45]:
df1.index.name = 'Index'
df1.columns.name = 'Columns'
df1

Columns      colA      colB
Index
A       -1.454366  0.815270
C        0.229098 -1.026179
E        0.477525  1.292698

In [46]:
df2.index.name = 'Index'
df2.columns.name = 'Columns'
df2

Columns      colA      colB      colC
Index
A       -0.731458 -1.605402  0.989476
B        0.110815 -0.380931  0.114959
C        0.345313 -1.734959  1.658351
D        2.299772 -0.471135  1.262715

In [47]:
pd.merge(df1, df2, left_index=True, right_index=True)

Columns    colA_x    colB_x    colA_y    colB_y      colC
Index
A       -1.454366  0.815270 -0.731458 -1.605402  0.989476
C        0.229098 -1.026179  0.345313 -1.734959  1.658351

In [48]:
pd.merge(df1, df2, left_index=True, right_index=True, suffixes=('_1', '_2'))

Columns    colA_1    colB_1    colA_2    colB_2      colC
Index
A       -1.454366  0.815270 -0.731458 -1.605402  0.989476
C        0.229098 -1.026179  0.345313 -1.734959  1.658351

In [49]:
pd.merge(df1, df2, left_index=True, right_index=True, suffixes=('_1', '_2'), how='outer')

Columns    colA_1    colB_1    colA_2    colB_2      colC
Index
A       -1.454366  0.815270 -0.731458 -1.605402  0.989476
B             NaN       NaN  0.110815 -0.380931  0.114959
C        0.229098 -1.026179  0.345313 -1.734959  1.658351
D             NaN       NaN  2.299772 -0.471135  1.262715
E        0.477525  1.292698       NaN       NaN       NaN

In [50]:
df1.merge(df2, left_index=True, right_index=True, suffixes=('_1', '_2'), how='outer')

Columns    colA_1    colB_1    colA_2    colB_2      colC
Index
A       -1.454366  0.815270 -0.731458 -1.605402  0.989476
B             NaN       NaN  0.110815 -0.380931  0.114959
C        0.229098 -1.026179  0.345313 -1.734959  1.658351
D             NaN       NaN  2.299772 -0.471135  1.262715
E        0.477525  1.292698       NaN       NaN       NaN

In [51]:
df1.join(df2, lsuffix='_1', rsuffix='_2')

Columns    colA_1    colB_1    colA_2    colB_2      colC
Index
A       -1.454366  0.815270 -0.731458 -1.605402  0.989476
C        0.229098 -1.026179  0.345313 -1.734959  1.658351
E        0.477525  1.292698       NaN       NaN       NaN

In [52]:
pd.concat([df1, df2])

           colA      colB      colC
Index
A     -1.454366  0.815270       NaN
C      0.229098 -1.026179       NaN
E      0.477525  1.292698       NaN
A     -0.731458 -1.605402  0.989476
B      0.110815 -0.380931  0.114959
C      0.345313 -1.734959  1.658351
D      2.299772 -0.471135  1.262715

In [53]:
pd.concat([df1, df2], axis=1)

Columns      colA      colB      colA      colB      colC
A       -1.454366  0.815270 -0.731458 -1.605402  0.989476
B             NaN       NaN  0.110815 -0.380931  0.114959
C        0.229098 -1.026179  0.345313 -1.734959  1.658351
D             NaN       NaN  2.299772 -0.471135  1.262715
E        0.477525  1.292698       NaN       NaN       NaN

In [54]:
pd.concat([df1, df2], ignore_index=True)

       colA      colB      colC
0 -1.454366  0.815270       NaN
1  0.229098 -1.026179       NaN
2  0.477525  1.292698       NaN
3 -0.731458 -1.605402  0.989476
4  0.110815 -0.380931  0.114959
5  0.345313 -1.734959  1.658351
6  2.299772 -0.471135  1.262715

## Hierarchial indexing

In [55]:
df = pd.DataFrame(np.random.randn(10, 2), index=[list('aaabbbccdd'), [1, 2, 3, 1, 2, 3, 1, 2, 1, 2]], columns=['A', 'B'])
df

            A         B
a 1 -1.170515  1.065789
  2 -0.699937  0.144079
  3  0.398542  0.026869
b 1  1.055837 -0.073183
  2 -0.665721 -0.044112
  3 -0.363267 -0.012345
c 1  0.042121  1.959296
  2 -0.198426  0.330534
d 1 -1.435828  0.027528
  2  1.120605 -0.224039

In [56]:
df.index.names = ['alpha', 'numeric']
df

                      A         B
alpha numeric
a     1       -1.170515  1.065789
      2       -0.699937  0.144079
      3        0.398542  0.026869
b     1        1.055837 -0.073183
      2       -0.665721 -0.044112
      3       -0.363267 -0.012345
c     1        0.042121  1.959296
      2       -0.198426  0.330534
d     1       -1.435828  0.027528
      2        1.120605 -0.224039

In [57]:
df.reset_index()

  alpha  numeric         A         B
0     a        1 -1.170515  1.065789
1     a        2 -0.699937  0.144079
2     a        3  0.398542  0.026869
3     b        1  1.055837 -0.073183
4     b        2 -0.665721 -0.044112
5     b        3 -0.363267 -0.012345
6     c        1  0.042121  1.959296
7     c        2 -0.198426  0.330534
8     d        1 -1.435828  0.027528
9     d        2  1.120605 -0.224039

In [58]:
df.unstack()

                A                             B
numeric         1         2         3         1         2         3
alpha
a       -1.170515 -0.699937  0.398542  1.065789  0.144079  0.026869
b        1.055837 -0.665721 -0.363267 -0.073183 -0.044112 -0.012345
c        0.042121 -0.198426       NaN  1.959296  0.330534       NaN
d       -1.435828  1.120605       NaN  0.027528 -0.224039       NaN

In [59]:
df.stack()

alpha  numeric
a      1        A   -1.170515
                B    1.065789
       2        A   -0.699937
                B    0.144079
       3        A    0.398542
                B    0.026869
b      1        A    1.055837
                B   -0.073183
       2        A   -0.665721
                B   -0.044112
       3        A   -0.363267
                B   -0.012345
c      1        A    0.042121
                B    1.959296
       2        A   -0.198426
                B    0.330534
d      1        A   -1.435828
                B    0.027528
       2        A    1.120605
                B   -0.224039
dtype: float64

In [60]:
df.stack().index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3], ['A', 'B']],
           labels=[[0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 3, 3, 3, 3], [0, 0, 1, 1, 2, 2, 0, 0, 1, 1, 2, 2, 0, 0, 1, 1, 0, 0, 1, 1], [0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1]],
           names=['alpha', 'numeric', None])

## Grouping operations in DataFrames

In [61]:
df = df.reset_index()
df

  alpha  numeric         A         B
0     a        1 -1.170515  1.065789
1     a        2 -0.699937  0.144079
2     a        3  0.398542  0.026869
3     b        1  1.055837 -0.073183
4     b        2 -0.665721 -0.044112
5     b        3 -0.363267 -0.012345
6     c        1  0.042121  1.959296
7     c        2 -0.198426  0.330534
8     d        1 -1.435828  0.027528
9     d        2  1.120605 -0.224039

In [62]:
grouped = df[['A','B']].groupby(df['alpha'])
grouped

In [63]:
grouped.describe()

          A                        ...            B
      count      mean       std    ...          50%       75%       max
alpha                              ...
a       3.0 -0.490637  0.805196    ...     0.144079  0.604934  1.065789
b       3.0  0.008950  0.919157    ...    -0.044112 -0.028229 -0.012345
c       2.0 -0.078152  0.170093    ...     1.144915  1.552106  1.959296
d       2.0 -0.157612  1.807671    ...    -0.098255 -0.035363  0.027528

[4 rows x 16 columns]

In [64]:
grouped.apply(pd.DataFrame.unstack)

alpha
a      A  0   -1.170515
          1   -0.699937
          2    0.398542
       B  0    1.065789
          1    0.144079
          2    0.026869
b      A  3    1.055837
          4   -0.665721
          5   -0.363267
       B  3   -0.073183
          4   -0.044112
          5   -0.012345
c      A  6    0.042121
          7   -0.198426
       B  6    1.959296
          7    0.330534
d      A  8   -1.435828
          9    1.120605
       B  8    0.027528
          9   -0.224039
dtype: float64

In [65]:
grouped[['A', 'B']].agg('mean')

              A         B
alpha
a     -0.490637  0.412246
b      0.008950 -0.043214
c     -0.078152  1.144915
d     -0.157612 -0.098255

In [66]:
from scipy import stats
grouped[['A', 'B']].transform(stats.zscore)

          A         B
0 -1.034131  1.406693
1 -0.318357 -0.577205
2  1.352488 -0.829488
3  1.394941 -1.206255
4 -0.898975 -0.036178
5 -0.495966  1.242433
6  1.000000  1.000000
7 -1.000000 -1.000000
8 -1.000000  1.000000
9  1.000000 -1.000000

## Transforming Values in DataFrames' axis indices

In [67]:
df2

Columns      colA      colB      colC
Index
A       -0.731458 -1.605402  0.989476
B        0.110815 -0.380931  0.114959
C        0.345313 -1.734959  1.658351
D        2.299772 -0.471135  1.262715

In [68]:
df2.index = ['Alpha', 'Beta', 'Gamma', 'Delta']
df2

Columns      colA      colB      colC
Alpha   -0.731458 -1.605402  0.989476
Beta     0.110815 -0.380931  0.114959
Gamma    0.345313 -1.734959  1.658351
Delta    2.299772 -0.471135  1.262715

In [69]:
df2.index = df2.index.map(lambda x : x[:3])
df2

Columns      colA      colB      colC
Alp     -0.731458 -1.605402  0.989476
Bet      0.110815 -0.380931  0.114959
Gam      0.345313 -1.734959  1.658351
Del      2.299772 -0.471135  1.262715

In [70]:
df2.rename(index={'Alp': 0, 'Bet': 1, 'Gam': 2, 'Del': 3}, columns={'colA': 'A', 'colB': 'B', 'colC': 'C'})

Columns         A         B         C
0       -0.731458 -1.605402  0.989476
1        0.110815 -0.380931  0.114959
2        0.345313 -1.734959  1.658351
3        2.299772 -0.471135  1.262715

## Handling missing data in DataFrames

### Filtering out missing data

In [71]:
for row, col in [('Bet', 'colA'), ('Bet', 'colB'), ('Bet', 'colC'), ('Del', 'colB'), ('Gam', 'colC')]:
    df2.at[row, col] = np.NaN

df2

Columns      colA      colB      colC
Alp     -0.731458 -1.605402  0.989476
Bet           NaN       NaN       NaN
Gam      0.345313 -1.734959       NaN
Del      2.299772       NaN  1.262715

In [72]:
df2.isnull()

Columns   colA   colB   colC
Alp      False  False  False
Bet       True   True   True
Gam      False  False   True
Del      False   True  False

In [73]:
df2.notnull()

Columns   colA   colB   colC
Alp       True   True   True
Bet      False  False  False
Gam       True   True  False
Del       True  False   True

In [74]:
df2.dropna(how='all')

Columns      colA      colB      colC
Alp     -0.731458 -1.605402  0.989476
Gam      0.345313 -1.734959       NaN
Del      2.299772       NaN  1.262715

In [75]:
df2.dropna(how='any')

Columns      colA      colB      colC
Alp     -0.731458 -1.605402  0.989476

### Filling in missing data

In [76]:
df2

Columns      colA      colB      colC
Alp     -0.731458 -1.605402  0.989476
Bet           NaN       NaN       NaN
Gam      0.345313 -1.734959       NaN
Del      2.299772       NaN  1.262715

In [77]:
df2.fillna(method='backfill', inplace=True)
df2

Columns      colA      colB      colC
Alp     -0.731458 -1.605402  0.989476
Bet      0.345313 -1.734959  1.262715
Gam      0.345313 -1.734959  1.262715
Del      2.299772       NaN  1.262715

## Transformation of DataFrames with Functions and Mappings

In [78]:
df2['Category'] = ['HIGH', 'LOW', 'LOW', 'HIGH']
df2

Columns      colA      colB      colC Category
Alp     -0.731458 -1.605402  0.989476     HIGH
Bet      0.345313 -1.734959  1.262715      LOW
Gam      0.345313 -1.734959  1.262715      LOW
Del      2.299772       NaN  1.262715     HIGH

In [79]:
df2['Category'] = df2['Category'].map({'HIGH': 'H', 'LOW': 'L'})
df2

Columns      colA      colB      colC Category
Alp     -0.731458 -1.605402  0.989476        H
Bet      0.345313 -1.734959  1.262715        L
Gam      0.345313 -1.734959  1.262715        L
Del      2.299772       NaN  1.262715        H

In [80]:
df2.drop('Category', axis=1).applymap(np.exp)

Columns      colA      colB      colC
Alp      0.481207  0.200809  2.689825
Bet      1.412431  0.176407  3.535008
Gam      1.412431  0.176407  3.535008
Del      9.971904       NaN  3.535008

## Discretization / Bucketing of DataFrame's values

In [81]:
arr = np.random.randn(10)
arr

array([-0.42018339,  0.99982969,  0.43103415, -0.65091287, -1.49874039,
       -1.23063497,  0.19400719, -0.99838235, -0.3676376 ,  1.73719932])

In [82]:
cat = pd.cut(arr, bins=5, labels=['Very Low', 'Low', 'Med', 'High', 'Very High'])
cat

[Low, High, Med, Low, Very Low, Very Low, Med, Very Low, Low, Very High]
Categories (5, object): [Very Low < Low < Med < High < Very High]

In [83]:
pd.DataFrame({'Value': arr, 'Category': cat})

    Category     Value
0        Low -0.420183
1       High  0.999830
2        Med  0.431034
3        Low -0.650913
4   Very Low -1.498740
5   Very Low -1.230635
6        Med  0.194007
7   Very Low -0.998382
8        Low -0.367638
9  Very High  1.737199

In [84]:
qcat = pd.qcut(arr, q=5, labels=['Very Low', 'Low', 'Med', 'High', 'Very High'])
qcat

[Med, Very High, High, Low, Very Low, Very Low, High, Low, Med, Very High]
Categories (5, object): [Very Low < Low < Med < High < Very High]

In [85]:
pd.DataFrame({'Value': arr, 'Category': cat, 'Quartile Category': qcat})

    Category Quartile Category     Value
0        Low               Med -0.420183
1       High         Very High  0.999830
2        Med              High  0.431034
3        Low               Low -0.650913
4   Very Low          Very Low -1.498740
5   Very Low          Very Low -1.230635
6        Med              High  0.194007
7   Very Low               Low -0.998382
8        Low               Med -0.367638
9  Very High         Very High  1.737199

In [86]:
pd.cut(arr, bins=5).categories

IntervalIndex([(-1.502, -0.852], (-0.852, -0.204], (-0.204, 0.443], (0.443, 1.09], (1.09, 1.737]]
              closed='right',
              dtype='interval[float64]')

In [87]:
pd.qcut(arr, q=5).categories

IntervalIndex([(-1.5, -1.045], (-1.045, -0.512], (-0.512, -0.143], (-0.143, 0.545], (0.545, 1.737]]
              closed='right',
              dtype='interval[float64]')

## Permuting and Sampling of DataFrames Values to Generate new DataFrames

In [88]:
df = pd.DataFrame(np.random.randn(10,5), index=np.sort(np.random.randint(0, 100, size=10)), columns=list('ABCDE'))
df

           A         B         C         D         E
9   0.593613 -0.542364 -1.719672 -0.578909  1.426949
10  0.276997  0.789667  0.322074  0.700392  0.388717
27 -0.041264  0.295884 -0.425280  1.727639 -0.868353
39 -0.820978 -1.099742  0.086730  0.456287  0.431033
44  2.072574 -0.537785 -1.378430 -0.492404  2.327738
45  1.804404 -0.249421 -0.820864 -1.493340  0.524176
61  0.345113  0.724375 -2.040381 -1.079778 -0.693424
71 -2.338046  1.662262 -0.275353 -0.746570  1.225103
85 -0.110432 -1.273489  0.031786  0.462358  0.353548
97 -1.061979 -0.261355 -1.171399 -1.857087 -0.144816

In [89]:
df.loc[np.random.permutation(df.index)]

           A         B         C         D         E
61  0.345113  0.724375 -2.040381 -1.079778 -0.693424
85 -0.110432 -1.273489  0.031786  0.462358  0.353548
44  2.072574 -0.537785 -1.378430 -0.492404  2.327738
39 -0.820978 -1.099742  0.086730  0.456287  0.431033
71 -2.338046  1.662262 -0.275353 -0.746570  1.225103
45  1.804404 -0.249421 -0.820864 -1.493340  0.524176
10  0.276997  0.789667  0.322074  0.700392  0.388717
9   0.593613 -0.542364 -1.719672 -0.578909  1.426949
97 -1.061979 -0.261355 -1.171399 -1.857087 -0.144816
27 -0.041264  0.295884 -0.425280  1.727639 -0.868353

In [90]:
df.iloc[np.random.randint(0, len(df), size=5)]

           A         B         C         D         E
27 -0.041264  0.295884 -0.425280  1.727639 -0.868353
45  1.804404 -0.249421 -0.820864 -1.493340  0.524176
45  1.804404 -0.249421 -0.820864 -1.493340  0.524176
9   0.593613 -0.542364 -1.719672 -0.578909  1.426949
85 -0.110432 -1.273489  0.031786  0.462358  0.353548

# File operations with DataFrames

## CSV files

### Writing csv files

In [91]:
df.to_csv('df.csv', sep=',', header=True, index=True)

In [92]:
%pycat df.csv

,A,B,C,D,E
9,0.5936127527039693,-0.542363581313287,-1.719672378632265,-0.5789087862396088,1.4269485506363453
10,0.2769969050973699,0.7896671305447348,0.32207411358372423,0.7003923770036988,0.3887166323316587
27,-0.04126386067735677,0.29588432121730995,-0.42527998805117745,1.7276391201667975,-0.8683525728302848
39,-0.8209775777189621,-1.0997420126347677,0.08672982893439583,0.4562870103794832,0.43103330308489607
44,2.072573534652599,-0.5377851185632266,-1.3784300958152218,-0.4924042501649364,2.3277381091718357
45,1.8044039661642386,-0.24942132634091757,-0.8208638292651728,-1.4933399582170666,0.524175945925593
61,0.34511317001597924,0.7243746800286961,-2.0403808422422274,-1.0797780988310783,-0.6934244111617518
71,-2.338046150957248,1.6622623438878599,-0.27535274222162914,-0.7465704488243654,1.2251034612955707
85,-0.1104324589602783,-1.2734893853043774,0.031786151729383684,0.4623583343156185,0.35354835026082904
97,-1.0619793207360517,-0.2613546728103239,-1.1713985180433313,-1.857087438077901,-0.14481625312704066

### Reading csv files

In [93]:
pd.read_csv('df.csv', sep=',', index_col=0, nrows=5)

           A         B         C         D         E
9   0.593613 -0.542364 -1.719672 -0.578909  1.426949
10  0.276997  0.789667  0.322074  0.700392  0.388717
27 -0.041264  0.295884 -0.425280  1.727639 -0.868353
39 -0.820978 -1.099742  0.086730  0.456287  0.431033
44  2.072574 -0.537785 -1.378430 -0.492404  2.327738

In [94]:
pd.read_csv('df.csv', sep=',', index_col=0, chunksize=2)

In [95]:
list(pd.read_csv('df.csv', sep=',', index_col=0, chunksize=2))

[           A         B         C         D         E
 9   0.593613 -0.542364 -1.719672 -0.578909  1.426949
 10  0.276997  0.789667  0.322074  0.700392  0.388717,
            A         B        C         D         E
 27 -0.041264  0.295884 -0.42528  1.727639 -0.868353
 39 -0.820978 -1.099742  0.08673  0.456287  0.431033,
            A         B         C         D         E
 44  2.072574 -0.537785 -1.378430 -0.492404  2.327738
 45  1.804404 -0.249421 -0.820864 -1.493340  0.524176,
            A         B         C         D         E
 61  0.345113  0.724375 -2.040381 -1.079778 -0.693424
 71 -2.338046  1.662262 -0.275353 -0.746570  1.225103,
            A         B         C         D         E
 85 -0.110432 -1.273489  0.031786  0.462358  0.353548
 97 -1.061979 -0.261355 -1.171399 -1.857087 -0.144816]

## JSON Files

In [96]:
df.iloc[:4].to_json('df.json')

In [97]:
%pycat df.json

{"A":{"9":0.5936127527,"10":0.2769969051,"27":-0.0412638607,"39":-0.8209775777},"B":{"9":-0.5423635813,"10":0.7896671305,"27":0.2958843212,"39":-1.0997420126},"C":{"9":-1.7196723786,"10":0.3220741136,"27":-0.4252799881,"39":0.0867298289},"D":{"9":-0.5789087862,"10":0.700392377,"27":1.7276391202,"39":0.4562870104},"E":{"9":1.4269485506,"10":0.3887166323,"27":-0.8683525728,"39":0.4310333031}}

In [98]:
pd.read_json('df.json')

           A         B         C         D         E
10  0.276997  0.789667  0.322074  0.700392  0.388717
27 -0.041264  0.295884 -0.425280  1.727639 -0.868353
39 -0.820978 -1.099742  0.086730  0.456287  0.431033
9   0.593613 -0.542364 -1.719672 -0.578909  1.426949